notebook/java/AtomicInteger.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-23 Mon 10:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AtomicInteger 源码分析</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Saul Lawliet" />
<link rel="stylesheet" href="/assets/css/org.css" type="text/css" />
<link rel="stylesheet" href="https://saullawliet.github.io/assets/css/org.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">AtomicInteger 源码分析</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgab64e77">sun.misc.Unsafe</a></li>
<li><a href="#orge684052">java.util.concurrent.atomic.AtomicInteger</a>
<ul>
<li><a href="#org9982489">类定义</a></li>
<li><a href="#orgf7c3540">主要方法</a></li>
</ul>
</li>
<li><a href="#org39707bd">小结</a></li>
</ul>
</div>
</div>
<p>
环境: <a href="http://hg.openjdk.java.net/jdk8/jdk8/jdk/file/687fd7c7986d">jdk8</a><br />
</p>

<div id="outline-container-orgab64e77" class="outline-2">
<h2 id="orgab64e77">sun.misc.Unsafe</h2>
<div class="outline-text-2" id="text-orgab64e77">
<p>
<a href="http://hg.openjdk.java.net/jdk8/jdk8/jdk/file/687fd7c7986d/src/share/classes/sun/misc/Unsafe.java">Unsafe类</a>是单例模式, 主要提供了一些操作内存的方法, 为了安全起见, 只有jdk源码才能使用该类<br />
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">Unsafe.java</span>
<span style="color: #859900; font-weight: bold;">private</span> <span style="color: #268bd2;">Unsafe</span>() {}
<span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900;">Unsafe</span> <span style="color: #268bd2;">theUnsafe</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">Unsafe</span>();
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #b58900;">Unsafe</span> <span style="color: #268bd2;">getUnsafe</span>() {
    <span style="color: #b58900;">Class</span>&lt;?&gt; <span style="color: #268bd2;">caller</span> = Reflection.getCallerClass();
    <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">&#24403;&#35843;&#29992;&#32773;&#31867;&#30340;&#21551;&#21160;&#22120;&#20026;null&#34920;&#31034;&#28304;&#30721;, &#21542;&#21017;&#25243;&#20986;&#24322;&#24120; */</span>
    <span style="color: #859900; font-weight: bold;">if</span> (<span style="color: #b58900; font-weight: bold;">!</span>VM.isSystemDomainLoader(caller.getClassLoader()))
        <span style="color: #859900; font-weight: bold;">throw</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">SecurityException</span>(<span style="color: #2aa198;">"Unsafe"</span>);
    <span style="color: #859900; font-weight: bold;">return</span> theUnsafe;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge684052" class="outline-2">
<h2 id="orge684052">java.util.concurrent.atomic.AtomicInteger</h2>
<div class="outline-text-2" id="text-orge684052">
</div>
<div id="outline-container-org9982489" class="outline-3">
<h3 id="org9982489">类定义</h3>
<div class="outline-text-3" id="text-org9982489">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">AtomicInteger.java</span>
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">AtomicInteger</span> <span style="color: #859900; font-weight: bold;">extends</span> <span style="color: #b58900;">Number</span> <span style="color: #859900; font-weight: bold;">implements</span> <span style="color: #268bd2; font-weight: bold;">java</span>.<span style="color: #268bd2; font-weight: bold;">io</span>.<span style="color: #b58900;">Serializable</span> {
    <span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">setup to use Unsafe.compareAndSwapInt for updates</span>
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900;">Unsafe</span> <span style="color: #268bd2;">unsafe</span> = Unsafe.getUnsafe();
    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">static</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900;">long</span> <span style="color: #268bd2;">valueOffset</span>; <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">&#32531;&#23384;&#21464;&#37327; value &#22312;&#20869;&#23384;&#30340;&#20301;&#32622; */</span>

    <span style="color: #859900; font-weight: bold;">static</span> {
        <span style="color: #859900; font-weight: bold;">try</span> {
            valueOffset = unsafe.objectFieldOffset
                (AtomicInteger.<span style="color: #859900; font-weight: bold;">class</span>.getDeclaredField(<span style="color: #2aa198;">"value"</span>));
        } <span style="color: #859900; font-weight: bold;">catch</span> (<span style="color: #b58900;">Exception</span> <span style="color: #268bd2;">ex</span>) { <span style="color: #859900; font-weight: bold;">throw</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">Error</span>(ex); }
    }

    <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #859900; font-weight: bold;">volatile</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">value</span>; <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">&#20445;&#35777;&#22312;&#19981;&#21516;&#32447;&#31243;&#30340;&#21487;&#35265;&#24615; */</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7c3540" class="outline-3">
<h3 id="orgf7c3540">主要方法</h3>
<div class="outline-text-3" id="text-orgf7c3540">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">AtomicInger.java</span>
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">addAndGet</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">delta</span>) {
    <span style="color: #859900; font-weight: bold;">return</span> unsafe.getAndAddInt(<span style="color: #859900; font-weight: bold;">this</span>, valueOffset, delta) + delta;
}

<span style="color: #93a1a1;">// </span><span style="color: #93a1a1;">Unsafe.java</span>
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #b58900;">int</span> <span style="color: #268bd2;">getAndAddInt</span>(<span style="color: #b58900;">Object</span> <span style="color: #268bd2;">o</span>, <span style="color: #b58900;">long</span> <span style="color: #268bd2;">offset</span>, <span style="color: #b58900;">int</span> <span style="color: #268bd2;">delta</span>) {
    <span style="color: #b58900;">int</span> <span style="color: #268bd2;">v</span>;
    <span style="color: #859900; font-weight: bold;">do</span> {
        v = getIntVolatile(o, offset); <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">&#25343;&#21040;&#24403;&#21069;&#21464;&#37327;&#30340;&#20540; */</span>
    } <span style="color: #859900; font-weight: bold;">while</span> (<span style="color: #b58900; font-weight: bold;">!</span>compareAndSwapInt(o, offset, v, v + delta)); <span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">&#19981;&#26029;&#37325;&#35797;, &#30452;&#21040;&#25104;&#21151;&#20026;&#27490; */</span>
    <span style="color: #859900; font-weight: bold;">return</span> v;
}

<span style="color: #93a1a1;">/* </span><span style="color: #93a1a1;">native &#26041;&#27861;, &#21407;&#23376;&#25805;&#20316;, &#20165;&#24403;&#20540;&#31561;&#20110; expected &#26102;, &#35774;&#32622;&#20540;&#20026; x, &#25104;&#21151;&#36820;&#22238; true */</span>
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">final</span> <span style="color: #859900; font-weight: bold;">native</span> <span style="color: #b58900;">boolean</span> <span style="color: #268bd2;">compareAndSwapInt</span>(<span style="color: #b58900;">Object</span> <span style="color: #268bd2;">o</span>, <span style="color: #b58900;">long</span> <span style="color: #268bd2;">offset</span>,
                                              <span style="color: #b58900;">int</span> <span style="color: #268bd2;">expected</span>,
                                              <span style="color: #b58900;">int</span> <span style="color: #268bd2;">x</span>);
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org39707bd" class="outline-2">
<h2 id="org39707bd">小结</h2>
<div class="outline-text-2" id="text-org39707bd">
<p>
这个类很简单, 仅仅用了关键字 volatile 和 Unsafe 类, 就实现了一个线程安全的 int 类型.<br />
</p>
<ul class="org-ul">
<li>线程间的可见性: volatile<br /></li>
<li>原子操作: Unsafe.compareAndSwap()<br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Saul Lawliet</p>
<p class="date">Created: 2020-03-23 Mon 10:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
